"""
Всем привет.
В суботу сделаю срез знаний по этим вопросам.
Список вопросов

1) Зачем нужны break и continue?

2) Для какиех целей следует использовать while,

а для каких for ... in ... ?

3) Что такое pass?

4) Чем отличаются list от tuple?

5) Области видимости. Классификация.

6) Как работает функции min и max со строками?

7) В python почти все это объекты. Функция тоже?

8) Какием образом передаются аргументы в функцию? (2 варианта)

9) Что такое Pep?

10)Что такое анонимные функции?

11) Зачем нужен оператор * (не про умножение)

12)Зачем нужны ключевые слова global и nonlocal?



13)Что такое хеш?

Какие базовые типы данных хэшируемые, а какие нет?

14)Что может быть ключом в словаре?



15) напиши кратчайшее решение такой задачи:

 - в словаре поменять местами ключи и значения

 - сгенерировать матрицу 5х5

 - получить уникальные значения из списка

16) Какие есть способы объявления строк?

17) Как перевернуть строку?

18) Приведите пример модификации списка

19) Как скопировать последовательность с помощью среза?

Как скопировать без среза?

20)Как получить перевернутую последовательность с помощью среза?

Напишите пример.



21) Как получить все ключи из словаря? Все значения?

Список с кортежами в которых находятся пары ключ, значения



22) Какие есть способы форматирования строк?



Напишите результаты выражений и

обясните почему именно такие результаты.

x = 200

y = x

1) x is y

2) x == y

---------

x1 = 200

y1 = 200

3) x1 is y1

4) x1 == y1

----------

x2 = 2000

y2 = 2000

5) x2 is y2

6) x2 == y2

Подготовьтесь. Я вас поспрашиваю.
"""